# Напишите программу для печати всех уникальных значений в словаре.

def task_3():
    dict = {'1': '1', '2': '2', '3': '3', '4': '3', '5': '3'}
    res = set()
    for i in dict.values():
        res.add(i)
    print(res)

task_3()